NeKarakasis/MC_Greece/RA6T2_MCIHV1_IPM_LESS_FOC_WHOLE_PFC_E2S_V100/src/application/user_interface/ics/r_mtr_ics.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2024 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name   : r_mtr_ics.c
* Description : Processes of a user interface (tool)
***********************************************************************************************************************/
/**********************************************************************************************************************
* History : DD.MM.YYYY Version
*         : 29.02.2024 1.00
***********************************************************************************************************************/

/***********************************************************************************************************************
* Includes <System Includes> , "Project Includes"
***********************************************************************************************************************/

#include <stdint.h>
#include "mtr_main.h"
#include "r_mtr_ics.h"
#include "ics2_RA6T2.h"
#include "hal_data.h"
#include "r_motor_common.h"
#include "r_motor_module_cfg.h"
#include "r_motor_sensorless_vector_api.h"
#include "r_system_manager_api.h"

/***********************************************************************************************************************
* Global variables
***********************************************************************************************************************/
uint16_t    g_u2_conf_hw;
uint16_t    g_u2_conf_sw;
uint16_t    g_u2_conf_tool;
uint8_t     gui_u1_active_gui;
uint16_t    g_u2_conf_sw_ver;
uint8_t     g_u1_conf_motor_type_len;
uint8_t     g_u1_conf_control_len;
uint8_t     g_u1_conf_inverter_len;
uint8_t     g_u1_conf_motor_type[CONF_MOTOR_TYPE_LEN];
uint8_t     g_u1_conf_control[CONF_CONTROL_LEN];
uint8_t     g_u1_conf_inverter[CONF_INVERTER_LEN];

/***********************************************************************************************************************
* Exported global variables (to be accessed by other files)
***********************************************************************************************************************/
st_rmw_param_buffer_t   g_st_rmw_input_buffer;  /* Structure for ICS input */
uint8_t     g_u1_update_param_flag = 0;         /* Update commands and configurations flag */

/* Operation variables */
uint8_t     com_u1_system_mode;                 /* System mode */
uint8_t     g_u1_system_mode;                   /* System mode */
uint8_t     com_u1_enable_write;                /* ICS write enable flag */
uint8_t     g_u1_enable_write;                  /* ICS write enable flag */

/* Offset parameters */
uint16_t    com_u2_offset_calc_time;            /* current offset calculation time */

/* Motor parameters */
uint16_t    com_u2_mtr_pp;                      /* pole pairs */
float       com_f4_mtr_r;                       /* resistance [ohm] */
float       com_f4_mtr_ld;                      /* d-axis inductance [H] */
float       com_f4_mtr_lq;                      /* q-axis inductance [H] */
float       com_f4_mtr_m;                       /* permanent magnetic flux [Wb] */
float       com_f4_mtr_j;                       /* rotor inertia [kgm^2] */
float       com_f4_nominal_current_rms;         /* The nominal current[Arms] */
float       com_f4_max_speed_rpm;               /* maximum speed [rpm] (mechanical) */

/* Sensorless parameter */
uint8_t     com_u1_ctrl_loop_mode;              /* loop mode select */
/* Current control */
float       com_f4_current_omega_hz;            /* natural frequency for current loop [Hz] */
float       com_f4_current_zeta;                /* damping ratio for current loop */

/* Speed control */
float       com_f4_speed_omega_hz;              /* natural frequency for speed loop [Hz] */
float       com_f4_speed_zeta;                  /* damping ratio for speed loop */
float       com_f4_speed_lpf_hz;                /* Natural frequency for speed LPF [Hz] */
float       com_f4_ref_speed_rpm;               /* motor speed reference [rpm] (mechanical) */
float       com_f4_speed_rate_limit_rpm;        /* limit of speed change [rpm/s] */
float       com_f4_overspeed_limit_rpm;         /* over speed limit [rpm] (mechanical) */


/* Optional functions */
/* Voltage error compensation */
uint8_t     com_u1_flag_volt_err_comp_use;      /* Flags whether use voltage error compensation */

/* Flux-weakening control */
uint8_t     com_u1_flag_fluxwkn_use;            /* Flags whether use flux-weakening */

/* MTPA control */
uint8_t     com_u1_flag_mtpa_use;               /* Flags whether use MTPA */

/* Flying Start control */
uint8_t     com_u1_flag_flying_start_use;       /* Flags whether use flying start */

/* Stall Detection control */
uint8_t     com_u1_flag_stall_detection_use;    /* Flags whether use stall Detection */

