NeKarakasis/MC_Greece/RA6T2_MCIHV1_IPM_LESS_FOC_WHOLE_PFC_E2S_V100/src/application/user_interface/ics/r_mtr_ics.c
/* Torque Vibration Compensation control */
uint8_t     com_u1_flag_trq_vibration_comp_use; /* Flags whether use torque vibration compensation */

/* BEMF observer */
float       com_f4_e_obs_omega_hz;              /* Natural frequency for BEMF observer [Hz] */
float       com_f4_e_obs_zeta;                  /* Damping ratio for BEMF observer */
float       com_f4_pll_est_omega_hz;            /* Natural frequency for rotor position Phase-Locked Loop [Hz] */
float       com_f4_pll_est_zeta;                /* Damping ratio for rotor position Phase-Locked Loop */

float       com_f4_pll_estlow_omega_hz;     /* Natural frequency for rotor position Phase-Locked Loop [Hz] (lowspd) */
float       com_f4_pll_estlow_zeta;         /* Damping ratio for rotor position Phase-Locked Loop (lowspd) */
/* Extended observe */
uint8_t     com_u1_flag_extobserver_use;    /* Flags whether use ext observer*/
float       com_f4_extobs_omega;            /* natural frequency for ext observer [Hz] */
/* low speed */
float       com_f4_spd_low_to_high_threshold; /* Slow-to-fast switching speed threshold [r/min] */
float       com_f4_spd_high_to_low_threshold; /* Fast to slow switching speed threshold [r/min] */

/* Stall detection */
float       com_f4_id_hpf_time;                 /* d-axis HPF time constant [s] */
float       com_f4_iq_hpf_time;                 /* d-axis HPF time constant [s] */
float       com_f4_threshold_level;             /* stall detection threshold [A] */
float       com_f4_threshold_time;              /* detection time [s] */

/* Torque vibration suppression */
uint8_t     com_u1_flag_trqvib_comp_learning;   /* Flags whether learning of Torque Vibration Compensation */
float       com_f4_timelead;                    /* Output phase index of Torque Vibration Compensation */
float       com_f4_tf_lpf_time;                 /* Tracking filter internal LPF constant */
float       com_f4_output_gain;                 /* Output gain (speed deviation/vibration torque conversion factor) */
float       com_f4_input_weight2;               /* coefficient for moving average filter */
float       com_f4_input_weight1;               /* coefficient for moving average filter */
float       com_f4_input_weight0;               /* coefficient for moving average filter */

/* Flying start */
float       com_f4_restart_speed;               /* Restart judgment speed reference value */
float       com_f4_off_time;                    /* Short-circuit OFF time [s] */
float       com_f4_over_time;                   /* Detection excess time */
float       com_f4_active_brake_time;           /* Active braking time */
float       com_f4_on_current_th;               /* Current threshold of Short-circuit ON */

/***********************************************************************************************************************
 Private global variables and functions
 **********************************************************************************************************************/
static uint8_t  s_u1_cnt_ics = 0;               /* Counter for period of calling "scope_watchpoint" */
static void r_app_rmw_system_mode(void);
static void r_app_rmw_check_com_input(void);
static void r_app_rmw_update_params(void);
static void r_app_rmw_update_command(void);

/***********************************************************************************************************************
* Function Name : r_app_rmw_ui_init
* Description   : Initialize variables for Analyzer interface
* Arguments     : None
* Return Value  : None
***********************************************************************************************************************/
void r_app_rmw_ui_init(void)
{
    /* ICS Communication variables, Do not delete these variables. */
    int i;
    uint8_t u1_conf_motor_type[] = CONF_MOTOR_TYPE;
    uint8_t u1_conf_control[]    = CONF_CONTROL;
    uint8_t u1_conf_inverter[]   = CONF_INVERTER;
    g_u1_conf_motor_type_len = CONF_MOTOR_TYPE_LEN;
    g_u1_conf_control_len    = CONF_CONTROL_LEN;
    g_u1_conf_inverter_len   = CONF_INVERTER_LEN;
    for (i = 0; i < g_u1_conf_motor_type_len; i++)
    {
        g_u1_conf_motor_type[i] = u1_conf_motor_type[i];
    }
    for (i = 0; i < g_u1_conf_control_len; i++)
    {
        g_u1_conf_control[i] = u1_conf_control[i];
    }
    for (i = 0; i < g_u1_conf_inverter_len; i++)
    {
        g_u1_conf_inverter[i] = u1_conf_inverter[i];
    }
    g_u2_conf_hw   = 0x0008;        /* 0000000000001000b */
    g_u2_conf_sw   = 0x0000;        /* 0000000000000000b */
    g_u2_conf_tool = 0x0300;        /* 0000011000000000b */

    /* Operation variables */
    com_u1_system_mode  = STATEMACHINE_EVENT_STOP;
    g_u1_system_mode    = STATEMACHINE_EVENT_STOP;
    com_u1_enable_write = 0;
    g_u1_enable_write   = 0;

    /* Offset parameters */
    com_u2_offset_calc_time = CURRENT_CFG_OFFSET_CALC_TIME;

    /* Motor parameters */
    com_u2_mtr_pp              = MOTOR_CFG_POLE_PAIRS;
    com_f4_mtr_r               = MOTOR_CFG_RESISTANCE;
    com_f4_mtr_ld              = MOTOR_CFG_D_INDUCTANCE;
    com_f4_mtr_lq              = MOTOR_CFG_Q_INDUCTANCE;
    com_f4_mtr_m               = MOTOR_CFG_MAGNETIC_FLUX;
    com_f4_mtr_j               = MOTOR_CFG_ROTOR_INERTIA;
    com_f4_nominal_current_rms = MOTOR_CFG_NOMINAL_CURRENT_RMS;
    com_f4_max_speed_rpm       = MOTOR_CFG_MAX_SPEED_RPM;

    /* Sensorless parameter */
    com_u1_ctrl_loop_mode    = MOTOR_COMMON_CFG_LOOP_MODE;

    /* Control parameters */
    /* Current control */
    com_f4_current_omega_hz = CURRENT_CFG_OMEGA;
    com_f4_current_zeta     = CURRENT_CFG_ZETA;

    /* Speed control */
    com_f4_speed_omega_hz       = SPEED_CFG_OMEGA;
    com_f4_speed_zeta           = SPEED_CFG_ZETA;
    com_f4_speed_lpf_hz         = SPEED_CFG_LPF_OMEGA;
    com_f4_ref_speed_rpm        = 0.0f;
    com_f4_speed_rate_limit_rpm = SPEED_CFG_RATE_LIMIT_RPM;
    com_f4_overspeed_limit_rpm  = SPEED_CFG_SPEED_LIMIT_RPM;

    /* Optional functions */
    /* Voltage error compensation */
    com_u1_flag_volt_err_comp_use = CURRENT_CFG_VOLT_ERR_COMP;

    /* Flux-weakening control */
    com_u1_flag_fluxwkn_use = SPEED_CFG_FLUX_WEAKENING;

    /* MTPA control */
    com_u1_flag_mtpa_use = SPEED_CFG_MTPA;

    /* Flying Start control */
    com_u1_flag_flying_start_use = CURRENT_CFG_FLYING_START;

    /* Stall Detection control */
    com_u1_flag_stall_detection_use = CURRENT_CFG_STALL_DETECTION;

