NeKarakasis/MC_Greece/RA6T2_MCIHV1_IPM_LESS_FOC_WHOLE_PFC_E2S_V100/src/application/user_interface/ics/r_mtr_ics.c
    /* Torque Vibration Compensation control */
    com_u1_flag_trq_vibration_comp_use = MTR_FLG_CLR;

    /* BEMF observer */
    com_f4_e_obs_omega_hz   = CURRENT_CFG_E_OBS_OMEGA;
    com_f4_e_obs_zeta       = CURRENT_CFG_E_OBS_ZETA;
    com_f4_pll_est_omega_hz = CURRENT_CFG_PLL_EST_OMEGA;
    com_f4_pll_est_zeta     = CURRENT_CFG_PLL_EST_ZETA;
    com_f4_pll_estlow_omega_hz = CURRENT_CFG_PLL_ESTLOW_OMEGA; /* low speed sensorless */
    com_f4_pll_estlow_zeta     = CURRENT_CFG_PLL_ESTLOW_ZETA; /* low speed sensorless */

    /* Speed observer */
    com_u1_flag_extobserver_use = SPEED_CFG_OBSERVER;
    com_f4_extobs_omega         = SPEED_CFG_SOB_OMEGA;

    /* low speed */
    com_f4_spd_low_to_high_threshold = MOTOR_SENSORLESS_VECTOR_THRESHOLD_HIGHSPEED * MTR_RAD2RPM; /* Slow-to-fast switching speed threshold [r/min] */
    com_f4_spd_high_to_low_threshold = MOTOR_SENSORLESS_VECTOR_THRESHOLD_LOWSPEED * MTR_RAD2RPM;  /* Fast to slow switching speed threshold [r/min] */

    /* Stall detection */
    com_f4_id_hpf_time     = CURRENT_CFG_STALL_D_HPF_GAIN;
    com_f4_iq_hpf_time     = CURRENT_CFG_STALL_Q_HPF_GAIN;
    com_f4_threshold_level = CURRENT_CFG_STALL_THRESHOLD_LEVEL;
    com_f4_threshold_time  = CURRENT_CFG_STALL_THRESHOLD_TIME;

    /* Torque vibration suppression */
    com_u1_flag_trqvib_comp_learning = MTR_FLG_CLR;
    com_f4_timelead                  = CURRENT_CFG_TRQVIB_TIMELEAP;
    com_f4_tf_lpf_time               = CURRENT_CFG_TRQVIB_LPF_GAIN;
    com_f4_output_gain               = CURRENT_CFG_TRQVIB_OUTPUT_GAIN;
    com_f4_input_weight2             = CURRENT_CFG_TRQVIB_INPUT_WEIGHT_2;
    com_f4_input_weight1             = CURRENT_CFG_TRQVIB_INPUT_WEIGHT_1;
    com_f4_input_weight0             = CURRENT_CFG_TRQVIB_INPUT_WEIGHT_0;

    /* Flying start */
    com_f4_restart_speed     = SENSORLESS_VECTOR_FLY_START_RESTART_SPEED_LIMIT;
    com_f4_off_time          = SENSORLESS_VECTOR_FLY_START_OFF_TIME_SEC;
    com_f4_over_time         = SENSORLESS_VECTOR_FLY_START_OVER_TIME_SEC;
    com_f4_active_brake_time = SENSORLESS_VECTOR_FLY_START_ACTIVE_BRAKE_TIME_SEC;
    com_f4_on_current_th     = SENSORLESS_VECTOR_FLY_START_CURRENT_TH;
} /* End of function r_app_rmw_ui_init */

/***********************************************************************************************************************
* Function Name : r_app_rmw_ui_mainloop
* Description   : RMW communication main-loop process
* Arguments     : None
* Return Value  : None
***********************************************************************************************************************/
void r_app_rmw_ui_mainloop(void)
{
    r_app_rmw_system_mode();
} /* End of function r_app_rmw_ui_mainloop */

/***********************************************************************************************************************
* Function Name : r_app_rmw_copy_com_to_buffer
* Description   : Set com variables to "tool" input buffer
* Arguments     : None
* Return Value  : None
***********************************************************************************************************************/
void r_app_rmw_copy_com_to_buffer(void)
{
    r_app_rmw_check_com_input();

    /***** When com_s2_enable_sw and g_u1_enable_write are same value, rewrite enable. *****/
    if (com_u1_enable_write == g_u1_enable_write)
    {
        /* Offset parameters */
        g_st_rmw_input_buffer.u2_offset_calc_time = com_u2_offset_calc_time;

        /* Motor parameters */
        g_st_rmw_input_buffer.st_motor.u2_mtr_pp              = com_u2_mtr_pp;
        g_st_rmw_input_buffer.st_motor.f4_mtr_r               = com_f4_mtr_r;
        g_st_rmw_input_buffer.st_motor.f4_mtr_ld              = com_f4_mtr_ld;
        g_st_rmw_input_buffer.st_motor.f4_mtr_lq              = com_f4_mtr_lq;
        g_st_rmw_input_buffer.st_motor.f4_mtr_m               = com_f4_mtr_m;
        g_st_rmw_input_buffer.st_motor.f4_mtr_j               = com_f4_mtr_j;
        g_st_rmw_input_buffer.st_motor.f4_nominal_current_rms = com_f4_nominal_current_rms;
        g_st_rmw_input_buffer.f4_max_speed_rpm                = com_f4_max_speed_rpm;

        /* Sensorless parameter */
        g_st_rmw_input_buffer.u1_ctrl_loop_mode    = com_u1_ctrl_loop_mode;
        /* Control parameters */
        /* Current control */
        g_st_rmw_input_buffer.f4_current_omega_hz = com_f4_current_omega_hz;
        g_st_rmw_input_buffer.f4_current_zeta     = com_f4_current_zeta;

        /* Speed control */
        g_st_rmw_input_buffer.f4_speed_omega_hz       = com_f4_speed_omega_hz;
        g_st_rmw_input_buffer.f4_speed_zeta           = com_f4_speed_zeta;
        g_st_rmw_input_buffer.f4_speed_lpf_hz         = com_f4_speed_lpf_hz;
        g_st_rmw_input_buffer.f4_ref_speed_rpm        = com_f4_ref_speed_rpm;
        g_st_rmw_input_buffer.f4_speed_rate_limit_rpm = com_f4_speed_rate_limit_rpm;
        g_st_rmw_input_buffer.f4_overspeed_limit_rpm  = com_f4_overspeed_limit_rpm;

        /* Optional functions */
        /* Voltage error compensation */
        g_st_rmw_input_buffer.u1_flag_volt_err_comp_use = com_u1_flag_volt_err_comp_use;

        /* Flux-weakening control */
        g_st_rmw_input_buffer.u1_flag_fluxwkn_use = com_u1_flag_fluxwkn_use;

        /* MTPA control */
        g_st_rmw_input_buffer.u1_flag_mtpa_use = com_u1_flag_mtpa_use;

        /* Flying Start control */
        g_st_rmw_input_buffer.u1_flag_flying_start_use = com_u1_flag_flying_start_use;

        /* Stall Detection control */
        g_st_rmw_input_buffer.u1_flag_stall_detection_use = com_u1_flag_stall_detection_use;

        /* Torque Vibration Compensation control */
        g_st_rmw_input_buffer.u1_flag_trq_vibration_comp_use = com_u1_flag_trq_vibration_comp_use;

        /* BEMF observer */
        g_st_rmw_input_buffer.f4_e_obs_omega_hz   = com_f4_e_obs_omega_hz;
        g_st_rmw_input_buffer.f4_e_obs_zeta       = com_f4_e_obs_zeta;
        g_st_rmw_input_buffer.f4_pll_est_omega_hz = com_f4_pll_est_omega_hz;
        g_st_rmw_input_buffer.f4_pll_est_zeta     = com_f4_pll_est_zeta;
        g_st_rmw_input_buffer.f4_pll_estlow_omega_hz = com_f4_pll_estlow_omega_hz; /* low speed sensorless */
        g_st_rmw_input_buffer.f4_pll_estlow_zeta     = com_f4_pll_estlow_zeta; /* low speed sensorless */

        /* Speed observer */
        g_st_rmw_input_buffer.u1_flag_extobserver_use = com_u1_flag_extobserver_use;
        g_st_rmw_input_buffer.f4_extobs_omega         = com_f4_extobs_omega;

        /* High/low speed switching speed threshold */
        g_st_rmw_input_buffer.f4_highspd_threshold    = com_f4_spd_low_to_high_threshold;
        g_st_rmw_input_buffer.f4_lowspd_threshold     = com_f4_spd_high_to_low_threshold;

        /* Stall detection */
        g_st_rmw_input_buffer.f4_id_hpf_time     = com_f4_id_hpf_time;
        g_st_rmw_input_buffer.f4_iq_hpf_time     = com_f4_iq_hpf_time;
        g_st_rmw_input_buffer.f4_threshold_level = com_f4_threshold_level;
        g_st_rmw_input_buffer.f4_threshold_time  = com_f4_threshold_time;

        /* Torque vibration suppression */
        g_st_rmw_input_buffer.u1_flag_trqvib_comp_learning = com_u1_flag_trqvib_comp_learning;
        g_st_rmw_input_buffer.f4_timelead                  = com_f4_timelead;
        g_st_rmw_input_buffer.f4_tf_lpf_time               = com_f4_tf_lpf_time;
        g_st_rmw_input_buffer.f4_output_gain               = com_f4_output_gain;
        g_st_rmw_input_buffer.f4_input_weight2             = com_f4_input_weight2;
        g_st_rmw_input_buffer.f4_input_weight1             = com_f4_input_weight1;
        g_st_rmw_input_buffer.f4_input_weight0             = com_f4_input_weight0;

