NeKarakasis/MC_Greece/RA6T2_MCIHV1_IPM_LESS_FOC_WHOLE_PFC_E2S_V100/src/application/user_interface/ics/r_mtr_ics.c
        /* Flying start */
        g_st_rmw_input_buffer.f4_restart_speed     = com_f4_restart_speed;
        g_st_rmw_input_buffer.f4_off_time          = com_f4_off_time;
        g_st_rmw_input_buffer.f4_over_time         = com_f4_over_time;
        g_st_rmw_input_buffer.f4_active_brake_time = com_f4_active_brake_time;
        g_st_rmw_input_buffer.f4_on_current_th     = com_f4_on_current_th;

        /* copy variables com to ICS input */
        g_u1_update_param_flag = 1;
        g_u1_enable_write     ^= 1;                     /* change every time 0 and 1 */
    }
} /* End of function r_app_rmw_copy_com_to_buffer */

/***********************************************************************************************************************
* Function Name : r_app_rmw_interrupt_handler
* Description   : Process for ICS(Analyzer)
* Arguments     : None
* Return Value  : None
***********************************************************************************************************************/
void r_app_rmw_interrupt_handler(void)
{
    s_u1_cnt_ics++;

    /* Decimation of ICS call */
    if (ICS_DECIMATION < s_u1_cnt_ics)
    {
        s_u1_cnt_ics = 0;

        /* Call ICS */
        ics2_watchpoint();
    }

    /* Update commands and configurations when trigger flag is set */
    if (1 == g_u1_update_param_flag)
    {
        r_app_rmw_update_params();
        g_u1_update_param_flag = 0;
    }
    else
    {
        r_app_rmw_update_command();
    }
} /* End of function r_app_rmw_interrupt_handler */

/***********************************************************************************************************************
* Function Name : r_app_rmw_system_mode
* Description   : Process of system mode command
* Arguments     : None
* Return Value  : None
************************************************************************************************************************/
static void r_app_rmw_system_mode(void)
{
    uint8_t  u1_motor_status;




        /*============================*/
        /*        Execute event       */
        /*============================*/
        R_SYSTEM_MANAGER_SystemMode();

        /*============================*/
        /*   Reset event function     */
        /*============================*/
        u1_motor_status = R_SYSTEM_MANAGER_MotorStatusGet(); /* Get status of motor control system */

        if (STATEMACHINE_EVENT_RESET == g_u1_system_mode)
        {
            if (STATEMACHINE_STATE_STOP == u1_motor_status)
            {
                r_app_rmw_ui_init();                         /* Initialize private global variables for reset event */
            }
            else if (STATEMACHINE_STATE_ERROR == u1_motor_status)
            {
                g_u1_system_mode   = STATEMACHINE_EVENT_ERROR;
                com_u1_system_mode = STATEMACHINE_EVENT_ERROR;
            }
            else
            {
                /* Do nothing */
            }

        }


} /* End of function r_app_rmw_system_mode */

/***********************************************************************************************************************
* Function Name : r_app_rmw_check_com_input
* Description   : Check com variables
* Arguments     : None
* Return Value  : None
***********************************************************************************************************************/
static void r_app_rmw_check_com_input(void)
{
    float f4_temp0;

    /**************************/
    /*    limit variables     */
    /**************************/
    com_f4_ref_speed_rpm = motor_filter_limitf_abs(com_f4_ref_speed_rpm, com_f4_max_speed_rpm);

    /* current natural frequency limit 1Hz ~ 1000Hz */
    com_f4_current_omega_hz = motor_filter_limitf(com_f4_current_omega_hz,
                                                  APP_CFG_MAX_CURRENT_OMEGA,
                                                  APP_CFG_MIN_OMEGA);

    /* natural frequency & damping ratio for speed control loop */
    f4_temp0 = com_f4_current_omega_hz / APP_CFG_FREQ_BAND_LIMIT;
    if (f4_temp0 < com_f4_speed_omega_hz)
    {
        com_f4_speed_omega_hz = f4_temp0;

        /* speed natural frequency minimum limit 1Hz */
        com_f4_speed_omega_hz = motor_filter_lower_limitf(com_f4_speed_omega_hz, APP_CFG_MIN_OMEGA);
    }
} /* End of function r_app_rmw_check_com_input */

/**********************************************************************************************************************
 * Function Name: r_app_rmw_update_params
 * Description  : Apply parameters in buffer through API
 * Arguments    : None
 * Return Value : None
 *********************************************************************************************************************/
static void r_app_rmw_update_params(void)
{
    R_SYSTEM_MANAGER_ParameterUpdate();
} /* End of function r_app_rmw_update_params */

/***********************************************************************************************************************
* Function Name : r_app_rmw_update_command
* Description   : Update commands without copying to buffer or update trigger
* Arguments     : None
* Return Value  : None
***********************************************************************************************************************/
static void r_app_rmw_update_command(void)
{
    R_SYSTEM_MANAGER_UpdateCommand();
} /* End of function r_app_rmw_update_command */
